title: DNS Enumeration via command-line tools
id: dodea-sig-013-dns-enumeration-via-
status: experimental
description: DNS Enumeration via command-line tools
author: adam.ring
date: 2025-07-31 00:00:00+00:00
tags:
  - attack.discovery
  - attack.t1046
  - ckc.reconnaissance
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: DeviceProcessEvents | where FileName in~ ("nslookup.exe", "whois.exe",
      "dig.exe") | project TimeGenerated, DeviceName, AccountName, FileName,
      ProcessCommandLine
  condition: selection
falsepositives: null
level: high
tactics:
  - discovery
techniques:
  - t1046
lifecycle: experimental
