title: LDAP/AD Enumeration (using PowerShell)
id: dodea-sig-014-ldap-ad-enumeration
status: experimental
description: LDAP/AD Enumeration (using PowerShell)
author: adam.ring
date: 2025-07-31 00:00:00+00:00
tags:
  - attack.discovery
  - attack.t1018
  - ckc
  - ckc.reconnaissance
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: >-
      DeviceProcessEvents | where ProcessCommandLine has_any ("Get-ADUser",
      "Get-ADComputer", "Get-DomainUser", "net group", "dsquery")

      | project TimeGenerated, DeviceName, AccountName, ProcessCommandLine
  condition: selection
falsepositives: null
level: high
tactics:
  - discovery
techniques:
  - t1018
lifecycle: experimental
