title: Net User Enumeration
id: dodea-sig-030-net-user-enumeration
status: experimental
description: Detects use of net.exe or net1.exe to enumerate user accounts.
author: Adam Ring
date: '2025-08-07'
tags:
- attack.discovery
- attack.t1087.001
- ckc.reconnaissance
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: DeviceProcessEvents | where FileName in~ ('net.exe', 'net1.exe') and ProcessCommandLine has 'user'
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- discovery
techniques:
- t1087
lifecycle: experimental
