title: Attempt to Disable Security Tools
id: a1b2c3d4-0009-0009-0009-000000000009
status: experimental
description: Detects attempts to disable Windows Defender or other security features
author: Adam Ring
date: '2025-07-31'
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - cyber-kill-chain.installation
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: >-
      DeviceProcessEvents| where ProcessCommandLine has_any ("Set-MpPreference",
      "DisableRealtimeMonitoring", "sc stop", "net stop", "reg add")| project
      TimeGenerated, DeviceName, FileName, ProcessCommandLine
  condition: selection
falsepositives:
  - None known
level: high
tactics:
  - defense_evasion
techniques:
  - t1562.001
lifecycle: experimental