title: Disable Script Block Logging
id: dodea-sig-028-disable-script-block-logging
status: experimental
description: Detects registry modifications that disable PowerShell script block logging.
author: Adam Ring
date: '2025-08-07'
tags:
- attack.defense_evasion
- attack.t1562.002
- ckc.installation
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    query: DeviceRegistryEvents | where RegistryKey has 'ScriptBlockLogging' and RegistryValueData =~ '0'
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- defense_evasion
techniques:
- t1562
lifecycle: experimental
