title: External Lookup Tool Usage
id: dodea-sig-001-external-lookup-tool-usage
status: experimental
description: Detects usage of tools like nslookup, whois, dig that indicate external reconnaissance.
author: Adam Ring
date: '2025-08-07'
tags:
- attack.reconnaissance
- attack.t1596
- ckc.reconnaissance
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: DeviceProcessEvents | where FileName in~ ('nslookup.exe', 'whois.exe', 'dig.exe')
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- reconnaissance
techniques:
- t1596
lifecycle: experimental
