title: VSSAdmin Delete Shadows
id: dodea-sig-035-vssadmin-delete-shadows
status: experimental
description: Detects deletion of shadow copies using vssadmin.exe.
author: Adam Ring
date: '2025-08-07'
tags:
- attack.impact
- attack.t1490
- ckc.actions-on-objectives
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: DeviceProcessEvents | where FileName =~ 'vssadmin.exe' and ProcessCommandLine has 'delete shadows'
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- impact
techniques:
- t1490
lifecycle: experimental
