title: OneDrive File Exfiltration
id: dodea-sig-034-onedrive-file-exfil
status: experimental
description: Detects suspicious data exfiltration via OneDrive.
author: Adam Ring
date: '2025-08-07'
tags:
- attack.exfiltration
- attack.t1567.002
- ckc.actions-on-objectives
logsource:
  product: m365
  service: onedrive
detection:
  selection:
    query: CloudAppEvents | where Application == 'OneDrive' and ActionType has 'FileUploaded'
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- exfiltration
techniques:
- t1567
lifecycle: experimental
