title: SMB Remote Scheduled Task
id: dodea-sig-031-smb-remote-schtask
status: experimental
description: Detects lateral movement using scheduled tasks via SMB.
author: Adam Ring
date: '2025-08-07'
tags:
- attack.lateral_movement
- attack.t1021.002
- ckc.command-and-control
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: DeviceProcessEvents | where FileName =~ 'schtasks.exe' and ProcessCommandLine has '\\'
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- lateral_movement
techniques:
- t1021
lifecycle: experimental
