title: External Remote Service Access (RDP, VPN)
id: dodea-sig-003-external-remote-serv
status: experimental
description: Detects remote access usage from unexpected geographic locations
author: Adam Ring
date: 2025-07-31
tags:
  - attack.initial_access
  - attack.t1133
  - ckc.command-and-control
logsource:
  product: azuread
  category: process_creation
detection:
  selection:
    query: >-
      SigninLogs| where AppDisplayName has_any ("RDP", "VPN", "Remote Desktop")

      | where Location != "US"| project TimeGenerated, UserPrincipalName, IPAddress, AppDisplayName, Location
  condition: selection
falsepositives:
  - None known
level: high
tactics:
  - initial_access
techniques:
  - t1133
lifecycle: experimental
