title: UAC Bypass Using EventViewer
id: dodea-sig-027-uac-bypass-eventviewer
status: experimental
description: Detects UAC bypass attempts using EventViewer (eventvwr.exe).
author: Adam Ring
date: '2025-08-07'
tags:
- attack.privilege_escalation
- attack.t1548.002
- ckc.installation
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: DeviceProcessEvents | where FileName =~ 'eventvwr.exe' and ProcessCommandLine has 'cmd'
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- privilege_escalation
techniques:
- t1548
lifecycle: experimental
