title: Clipboard Data Collection
id: dodea-sig-032-clipboard-data-collection
status: experimental
description: Detects use of tools accessing clipboard data.
author: Adam Ring
date: '2025-08-07'
tags:
- attack.collection
- attack.t1115
- ckc.actions-on-objectives
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: DeviceProcessEvents | where ProcessCommandLine has_any ('clip', 'Get-Clipboard')
  condition: selection
falsepositives:
- None known
level: medium
tactics:
- collection
techniques:
- t1115
lifecycle: experimental
