title: Data Collection from Local System
id: dodea-sig-018-data-collection-from
status: experimental
description: Detects enumeration or access to sensitive files on the local system
author: Adam Ring
date: 2025-07-31 00:00:00+00:00
tags:
  - attack.collection
  - attack.t1005
  - ckc.actions-on-objectives
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    query: >-
      DeviceFileEvents | where FolderPath has_any ("C:\Users\", "Desktop",
      "Documents")

      | where FileName endswith ".docx" or FileName endswith ".pdf" or FileName endswith ".xls" or FileName endswith ".csv"

      | project TimeGenerated, DeviceName, FileName, FolderPath, ActionType
  condition: selection
falsepositives:
  - None known
level: medium
tactics:
  - collection
techniques:
  - t1005
lifecycle: experimental
