title: External PowerShell or LOLBin traffic
id: dodea-sig-020-external-powershell-LOLBIN-traffic
status: experimental
description: External PowerShell or LOLBin traffic
author: adam.ring
date: 2025-07-31 00:00:00+00:00
tags:
  - attack.command_and_control
  - attack.t1071.001
  - ckc
  - ckc.command-and-control
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    query: >-
      DeviceNetworkEvents | where RemoteIPType == "Public"

      | where InitiatingProcessFileName in~ ("powershell.exe", "wscript.exe", "mshta.exe")
  condition: selection
falsepositives: null
level: high
tactics:
  - command_and_control
techniques:
  - t1071.001
lifecycle: experimental
